// pages/classify/policy/policy.js
const {
  $Toast
} = require('../../../colorui/dist/base/index');
Page({

  /**
   * 页面的初始数据
   */
  data: {
    modalName: '',
    listitem: [{
      id: 1,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 60,
      praise: 56,
      message: 24
    }, {
      id: 2,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 85,
      praise: 45,
      message: 68
    }, {
      id: 3,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定劳务派遣工政促进劳动关系和谐稳定为规范劳务派遣，维',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 25,
      praise: 45,
      message: 68
    }, {
      id: 4,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定劳务派遣工政促进劳动关系和谐稳定为规范劳务派遣，维',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 35,
      praise: 45,
      message: 68
    }, {
      id: 5,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定劳务派遣工政促进劳动关系和谐稳定为规范劳务派遣，维',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 45,
      praise: 45,
      message: 68
    }, {
      id: 6,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定劳务派遣工政促进劳动关系和谐稳定为规范劳务派遣，维',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 55,
      praise: 45,
      message: 68
    }, {
      id: 7,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定劳务派遣工政促进劳动关系和谐稳定为规范劳务派遣，维',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 65,
      praise: 45,
      message: 68
    }, {
      id: 8,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定劳务派遣工政促进劳动关系和谐稳定为规范劳务派遣，维',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 75,
      praise: 45,
      message: 68
    }, {
      id: 9,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定劳务派遣工政促进劳动关系和谐稳定为规范劳务派遣，维',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 85,
      praise: 45,
      message: 68
    }, {
      id: 10,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定劳务派遣工政促进劳动关系和谐稳定为规范劳务派遣，维',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 95,
      praise: 45,
      message: 68
    }, {
      id: 11,
      img: 'https://ossweb-img.qq.com/images/lol/web201310/skin/big10006.jpg',
      tit: '劳务派遣工政策的相关规定',
      con: '为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定为规范劳务派遣，维护劳动者的合法权益，促进劳动关系和谐稳定',
      browse: 105,
      praise: 45,
      message: 68
    }],
    txtcon: {}
  },
  showModal(e) {
    //console.log(e.currentTarget.dataset.target);
    this.setData({
      modalName: 'viewModal',
      txtcon: e.currentTarget.dataset.target
    });
    //console.log(this.data.txtcon);
  },
  hideModal(e) {
    this.setData({
      modalName: null
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {
    wx.showToast({
      title: '正在加载',
      icon: 'loading',
      duration: 3000
    })
    this.setData({
      title: options.title
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})